In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('./test.csv')
df

   c1   c2         c3    c4
0  CA   CA        chr  A100
1  FL  NaN       mike  A101
2  FL   FL  christian  A111
3  CA   FL        mik  B100
4  GA   MI   christia  B101
5  WA   FL          m  B111
6  CA   FL       mike  C100

In [3]:
# Clean up States
bkup = df['c1'] # will be used later to reference states
stacked = df[{'c1','c2'}].stack().astype('category')
result = stacked.cat.codes.unstack()
print(result)
print(df)
df['c1'] = result['c1'] + 1
df['c2'] = result['c2'] + 1
df = df.fillna(0)
print('after nan = 0:\n',df)

    c2   c1
0  0.0  0.0
1  NaN  1.0
2  1.0  1.0
3  1.0  0.0
4  3.0  2.0
5  1.0  4.0
6  1.0  0.0
   c1   c2         c3    c4
0  CA   CA        chr  A100
1  FL  NaN       mike  A101
2  FL   FL  christian  A111
3  CA   FL        mik  B100
4  GA   MI   christia  B101
5  WA   FL          m  B111
6  CA   FL       mike  C100
after nan = 0:
     c1   c2         c3    c4
0  1.0  1.0        chr  A100
1  2.0  0.0       mike  A101
2  2.0  2.0  christian  A111
3  1.0  2.0        mik  B100
4  3.0  4.0   christia  B101
5  5.0  2.0          m  B111
6  1.0  2.0       mike  C100

In [4]:
# Encode Names with similar spelling
df['c3'] = df['c3'].str.upper()
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()
le2 = LabelEncoder() #need a label encoder for each column
#le = le.fit(df['c3'])
enc_names = le.fit_transform(df['c3'])
enc_labels = le2.fit_transform(df['c4'])
# m, mik, and mike are a lot closer numerically than chr, christian, and christia. Perhaps can use floats insteead of ints to be more accurate with a larger CSV sample.
df['c3'] = enc_names
df['c4']= enc_labels
df

    c1   c2  c3  c4
0  1.0  1.0   0   0
1  2.0  0.0   5   1
2  2.0  2.0   2   2
3  1.0  2.0   4   3
4  3.0  4.0   1   4
5  5.0  2.0   3   5
6  1.0  2.0   5   6

In [5]:
#Revert back 
df['c3_'] = le.inverse_transform(df['c3'])
df['c4_'] = le2.inverse_transform(df['c4'])
df

    c1   c2  c3  c4        c3_   c4_
0  1.0  1.0   0   0        CHR  A100
1  2.0  0.0   5   1       MIKE  A101
2  2.0  2.0   2   2  CHRISTIAN  A111
3  1.0  2.0   4   3        MIK  B100
4  3.0  4.0   1   4   CHRISTIA  B101
5  5.0  2.0   3   5          M  B111
6  1.0  2.0   5   6       MIKE  C100